# Forward

## Description
Procedure Forward moves the selected objects up one level in the onscreen object stacking order.

Objects in the document are drawn in the order in which they are created, with newer objects drawn on top of previously created objects. It is sometimes necessary to adjust this drawing, or stacking, order in order to make objects visible or create a desired effect.

```pascal
PROCEDURE Forward;
```

```python
def vs.Forward():
    return None
```

## See Also
VS Functions:
HMoveForward

## Version
Availability: from All Versions

## Category
* General Edit